In [2]:
import pandas as pd

In [13]:
df0 = pd.DataFrame([1,2,3,4,5,0], [1,2,3,4,5,6])
df0

   0
1  1
2  2
3  3
4  4
5  5
6  0

In [16]:
data = [1,2,3,44,22,33]

In [17]:
s1 = pd.Series(data)
s1

0     1
1     2
2     3
3    44
4    22
5    33
dtype: int64

In [21]:
s1 = pd.Series(data,index = [1,2,'a','b','c',9])
s1

1     1
2     2
a     3
b    44
c    22
9    33
dtype: int64

In [25]:
s1['c']

22

In [31]:
s1[-6:]

1     1
2     2
a     3
b    44
c    22
9    33
dtype: int64

In [33]:
D1 = {"Minh": 22, 'Nam':26,'Hồng': 34}

In [34]:
type(D1)

dict

In [35]:
s2 = pd.Series(D1)

In [36]:
s2

Minh    22
Nam     26
Hồng    34
dtype: int64

In [65]:
Fr = {'Fruits': ['mango','banana','mangosteen','apple'],'Quantity':[11,22,33,44],'Price':[5,8,9,3]}

In [38]:
fruits

{'fruits': ['mango', 'banana', 'mangosteen', 'apple'],
 'quantity': ['11,22,33,44']}

In [91]:
df = pd.DataFrame(Fr)
df

       Fruits  Quantity  Price
0       mango        11      5
1      banana        22      8
2  mangosteen        33      9
3       apple        44      3

In [74]:
Fr1 = [['Fruits','Price','Quantity'],['Mango','$10',9],['Banana','$6',5],['Oranges','$15',10]]

In [75]:
fruit_df1 = pd.DataFrame(Fr1)
fruit_df1

         0      1         2
0   Fruits  Price  Quantity
1    Mango    $10         9
2   Banana     $6         5
3  Oranges    $15        10

In [96]:
df.iloc[-1:]

  Fruits  Quantity  Price
3  apple        44      3